app/controllers/experiments_controller.rb

  def index
    @experiments = Experiment.where(:user_id => current_user.id)
---
SELECT * FROM `experiments` WHERE (`experiments`.`user_id` = 1) LIMIT 1

  def show
    @experiment = Experiment.obfuscated_query(params[:id]).includes(:slots).first
    page_group(@experiment.user.group)
---
SELECT * FROM `slots` WHERE (`slots`.experiment_id = 1)
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
SELECT count(*) AS count_all FROM `slots` WHERE (`slots`.experiment_id = 1)

  def participate
    @experiment = Experiment.obfuscated(params[:id])
    page_group(@experiment.user.group)
---
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1

  def edit
    @experiment = Experiment.obfuscated(params[:id])
    page_group(@experiment.user.group)
---
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1

  def create
    @experiment = Experiment.new(params[:experiment])

    @experiment.user = current_user
    page_group(@experiment.user.group)

    location = Location.obfuscated(params[:location_id])
    @experiment.location = location
    calendar = GoogleCalendar.obfuscated(params[:calendar_id])
    @experiment.google_calendar = calendar
    respond_to do |format|
      if @experiment.save
---
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
INSERT INTO `experiments` (`name`, `updated_at`, `time_length`, `num_participants`, `desc`, `hashed_id`, `user_id`, `slot_close_time`, `open`, `created_at`) VALUES('', '2009-12-22 06:17:31', NULL, 0, x'23204d41562d5655452055736162696c697479210d0a0d0a486572652773206120676f6f64206578616d706c65206f662075736162696c69747920696e204d61762d767565210d0a', 0, 1, 0, 0, '2009-12-22 06:17:31')

  def update
    @experiment = Experiment.obfuscated(params[:id])
    page_group(@experiment.user.group)

    if @experiment.nil? or !@experiment.can_modify?(current_user)
      access_denied
      return
    end
    location = Location.obfuscated(params[:location_id])
    @experiment.location = location
    calendar = GoogleCalendar.obfuscated(params[:calendar_id])
    @experiment.google_calendar = calendar
    respond_to do |format|
      if @experiment.update_attributes(params[:experiment])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
UPDATE `experiments` SET `updated_at` = '2009-12-22 06:19:02', `name` = 'Second Exp' WHERE `id` = 2