app/controllers/experiments_controller.rb

SELECT * FROM `experiments` WHERE (`experiments`.`hashed_id` = '321060967') LIMIT 1
---
  def show
    @experiment = Experiment.find_by_hashed_id(params[:id])

SELECT * FROM `experiments` WHERE (`experiments`.`hashed_id` = '321060967') LIMIT 1
---
  def filled
    @experiment = Experiment.find_by_hashed_id(params[:id])

SELECT * FROM `experiments` WHERE (`experiments`.`hashed_id` = '321060967') LIMIT 1
---
  def participate
    @experiment = Experiment.find_by_hashed_id(params[:id])

SELECT * FROM `experiments` WHERE (`experiments`.`hashed_id` = '642121934') LIMIT 1
---
  def edit
    @experiment = Experiment.find_by_hashed_id(params[:id])

SELECT * FROM `experiments` WHERE (`experiments`.`hashed_id` = '642121934') LIMIT 1
---
  def update
    @experiment = Experiment.find_by_hashed_id(params[:id])