app/controllers/slots_controller.rb

SELECT * FROM `experiments` WHERE (`experiments`.`hashed_id` IS NULL) LIMIT 1
SELECT * FROM `slots` WHERE (subject_id is not NULL AND cancelled = 0)
---
  def index
    @experiment = Experiment.find_by_hashed_id(params[:experiment])
    if @experiment.nil? or !@experiment.can_modify?(current_user)
      access_denied
      return
    end
    @slots = Slot.find(:all, :conditions => {:experiment_id => @experiment.id}, :order => "time")

SELECT * FROM `slots` WHERE (`slots`.`hashed_id` = '321060967') LIMIT 1
---
  def show
    @slot = Slot.find_by_hashed_id(params[:id], :include => :experiment)

SELECT * FROM `slots` WHERE (`slots`.`hashed_id` = '1471152679') LIMIT 1
UPDATE `slots` SET `cancelled` = 1, `updated_at` = '2009-12-15 00:55:51' WHERE `id` = 7
---
  def cancel
    @slot = Slot.find_by_hashed_id(params[:id], :include => :experiment)
    @experiment = @slot.experiment
    if @experiment.nil? or !@experiment.can_modify?(current_user)
      access_denied
      return
    end
    page_title([@experiment.name, "Slot Cancelled", @slot.human_time])
    if @experiment.can_modify?(current_user)
    @slot.cancelled = true
    @slot.save!

INSERT INTO `slots` (`experiment_id`, `updated_at`, `time`, `scheduled_in_background`, `lock_version`, `hashed_id`, `subject_id`, `cancelled`, `created_at`) VALUES(1, '2009-12-23 21:42:00', '2009-12-23 21:41:00', 0, 0, 0, NULL, 0, '2009-12-23 21:42:00')
---
  def create
    @slot = Slot.new(params[:slot])
    @experiment = Experiment.find_by_hashed_id(params[:experiment_id])
    if @experiment.nil? or !@experiment.can_modify?(current_user)
      access_denied
      return
    end
    @slot.experiment = @experiment
    respond_to do |format|
      if @experiment.can_modify?(current_user) and @slot.save