app/controllers/slots_controller.rb

  def index
    @experiment = Experiment.obfuscated(params[:experiment])
    page_group(@experiment.user.group)
---
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1

  def new
    page_title("New Time Slot")
    @slot = Slot.new
    @experiment = Experiment.obfuscated_query(params[:id]).includes(:slots).first
---
SELECT * FROM `experiments`