app/controllers/subjects_controller.rb

  def new
    @experiment = Experiment.find_by_hashed_id(params[:id], :include => :slots)
    page_group(@experiment.user.group)
---
SELECT * FROM `experiments` LIMIT 1
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1

  def create
     @experiment = Experiment.find_by_hashed_id(params[:experiment_id])
     page_group(@experiment.user.group)
---
SELECT * FROM `experiments` LIMIT 1