app/controllers/subjects_controller.rb

  def new
    @experiment = Experiment.find(:first)
---
SELECT * FROM `experiments` WHERE (`experiments`.`id` = 321060967)