app/controllers/subjects_controller.rb

SELECT * FROM `subjects`
---
  def index
    @subjects = Subject.all

SELECT * FROM `experiments` WHERE (`experiments`.`hashed_id` = '321060967') LIMIT 1
SELECT * FROM `slots` WHERE (subject_id is not NULL AND cancelled = 0 and experiment_id = 1)
---
  def new
    @experiment = Experiment.find_by_hashed_id(params[:id])
    page_title([@experiment.name, "Sign up"])
    if Slot.find_by_occupied(@experiment).length > 15
      redirect_to :controller=>'experiments', :action=>'filled', :id=>@experiment.hashed_id
      return
    end
    @subject = Subject.new
    @slots = Slot.find(:all, :conditions => {:subject_id => nil})

SELECT * FROM `subjects` WHERE (`subjects`.`hashed_id` = '642121934') LIMIT 1
---
  def confirmation
     @subject = Subject.find_by_hashed_id(params[:id])

SELECT * FROM `experiments` WHERE (`experiments`.`hashed_id` = '321060967') LIMIT 1
SELECT * FROM `slots` WHERE (subject_id is not NULL AND cancelled = 0 and experiment_id = 1)
SELECT * FROM `slots` WHERE (`slots`.`hashed_id` = '321060967') LIMIT 1
INSERT INTO `subjects` (`updated_at`, `encrypted_email`, `encrypted_name`, `hashed_id`, `encrypted_phone_number`, `created_at`) VALUES('2009-12-23 20:57:28', 'LC7oLAcQ5aTftrk+EYN1Jct08X59tqueGua1DI+VRa0=\n', 'yVbiLl9PVokryKl5ZQjqPQ==\n', 0, 'hMJO+w1Zf6AdgOYhiNKdhQ==\n', '2009-12-23 20:57:28')
UPDATE `slots` SET `subject_id` = 1, `updated_at` = '2009-12-23 20:57:28' WHERE `id` = 1
---
  def create
     @experiment = Experiment.find_by_hashed_id(params[:experiment_id])
    if Slot.find_by_occupied(@experiment).length >= @experiment.num_subjects
      redirect_to :controller=>'experiments', :action=>'filled', :id=>@experiment.hashed_id
      return
    end
    @subject = Subject.new(params[:subject])
    @slots = Slot.find(:all, :conditions => {:subject_id => nil})
    @slot_id = params[:slot_id]
    @slot = Slot.find_by_hashed_id(@slot_id)
    respond_to do |format|
      if @subject.valid? and !@slot.nil? and @slot.subject.nil?
        @subject.transaction do
          @slot.transaction do
            @subject.save
            @slot.subject = @subject
            @slot.save