app/controllers/users_controller.rb

SELECT * FROM `users` LIMIT 1
INSERT INTO `users` (`name`, `salt`, `last_authenticated_ip`, `last_failed_ip`, `last_authenticated_at`, `activated_at`, `recover_requested`, `last_failed_at`, `updated_at`, `crypted_password`, `recover_requested_at`, `frozen_in_db`, `remember_token_expires_at`, `activation_code`, `lock_version`, `hashed_id`, `recover_in_process_code`, `deactivated_at`, `phone`, `remember_token`, `recover_code`, `eula_version`, `login`, `email`, `failure`, `created_at`) VALUES('Dave', '32b3c48e0d93bc3771a3cbc298d04c723ae3f858487387db4a6273c6bef8665b', NULL, NULL, NULL, NULL, 0, NULL, '2009-12-29 05:45:26', 'ae77c03799fedb9f73150bc7c0b5f1c0137cacbcb29abbb7d59af6c9eda94b2f', NULL, 0, NULL, 'PPCmoQtsSJLW9h/DmOji8t5D0XQ', 0, 0, NULL, NULL, '5555555555', NULL, NULL, 0, 'edave', 'dpitman@gmail.com', 0, '2009-12-29 05:45:26')
SELECT * FROM `roles` WHERE (`roles`.`slug` = 'experimenter') LIMIT 1
INSERT INTO `privileges` (`modified_by_user_id`, `updated_at`, `role_id`, `lock_version`, `hashed_id`, `user_id`, `created_at`) VALUES(8, '2009-12-29 05:55:55', 2, 0, 0, 8, '2009-12-29 05:55:55')
---
  def create
    @user = User.new(params[:user])
    group = Group.find_by_hashed_id(params[:group_id])
    @user.group_id = group.id unless group.nil?
    User.transaction do
        Privilege.transaction do
        @user.save!
        @user.reload
        current_user = @user
        current_user_id = @user.id
         #Create the necessary privileges
        @privilege = Privilege.new()
        @privilege.user = @user

        @privilege.role = Role.find_by_slug("experimenter")

        ActiveRecord::Base.current_user_id = current_user_id
        @privilege.save!

SELECT * FROM `users` WHERE (`users`.`activation_code` = 'QfnooZngK5Ojsfyuh4zvvz3gL2I') LIMIT 1
---
  def activate
    @user = User.find_by_activation_code(params[:id])